analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/wut_regs.h
/**
 * @file    wut_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the WUT Peripheral Module.
 * @note    This file is @generated.
 * @ingroup wut_registers
 */

/******************************************************************************
 *
 * Analog Devices, Inc.),
 * Copyright (C) 2024 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_WUT_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_WUT_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     wut
 * @defgroup    wut_registers WUT_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the WUT Peripheral Module.
 * @details     32-bit reloadable timer that can be used for timing and wakeup.
 */

/**
 * @ingroup wut_registers
 * Structure type to access the WUT Registers.
 */
typedef struct {
    __IO uint32_t cnt;                  /**< <tt>\b 0x00:</tt> WUT CNT Register */
    __IO uint32_t cmp;                  /**< <tt>\b 0x04:</tt> WUT CMP Register */
    __R  uint32_t rsv_0x8;
    __IO uint32_t intfl;                /**< <tt>\b 0x0C:</tt> WUT INTFL Register */
    __IO uint32_t ctrl;                 /**< <tt>\b 0x10:</tt> WUT CTRL Register */
    __I  uint32_t nolcmp;               /**< <tt>\b 0x14:</tt> WUT NOLCMP Register */
} mxc_wut_regs_t;

/* Register offsets for module WUT */
/**
 * @ingroup    wut_registers
 * @defgroup   WUT_Register_Offsets Register Offsets
 * @brief      WUT Peripheral Register Offsets from the WUT Base Peripheral Address.
 * @{
 */
#define MXC_R_WUT_CNT                      ((uint32_t)0x00000000UL) /**< Offset from WUT Base Address: <tt> 0x0000</tt> */
#define MXC_R_WUT_CMP                      ((uint32_t)0x00000004UL) /**< Offset from WUT Base Address: <tt> 0x0004</tt> */
#define MXC_R_WUT_INTFL                    ((uint32_t)0x0000000CUL) /**< Offset from WUT Base Address: <tt> 0x000C</tt> */
#define MXC_R_WUT_CTRL                     ((uint32_t)0x00000010UL) /**< Offset from WUT Base Address: <tt> 0x0010</tt> */
#define MXC_R_WUT_NOLCMP                   ((uint32_t)0x00000014UL) /**< Offset from WUT Base Address: <tt> 0x0014</tt> */
/**@} end of group wut_registers */

/**
 * @ingroup  wut_registers
 * @defgroup WUT_CNT WUT_CNT
 * @brief    Count. This register stores the current timer count.
 * @{
 */
#define MXC_F_WUT_CNT_COUNT_POS                        0 /**< CNT_COUNT Position */
#define MXC_F_WUT_CNT_COUNT                            ((uint32_t)(0xFFFFFFFFUL << MXC_F_WUT_CNT_COUNT_POS)) /**< CNT_COUNT Mask */

/**@} end of group WUT_CNT_Register */

/**
 * @ingroup  wut_registers
 * @defgroup WUT_CMP WUT_CMP
 * @brief    Compare. This register stores the compare value for the timer's count value.
 * @{
 */
#define MXC_F_WUT_CMP_COMPARE_POS                      0 /**< CMP_COMPARE Position */
#define MXC_F_WUT_CMP_COMPARE                          ((uint32_t)(0xFFFFFFFFUL << MXC_F_WUT_CMP_COMPARE_POS)) /**< CMP_COMPARE Mask */

/**@} end of group WUT_CMP_Register */

/**
 * @ingroup  wut_registers
 * @defgroup WUT_INTFL WUT_INTFL
 * @brief    Timer Interrupt Flag. Writing a value (0 or 1) to a bit in this register clears
 *           the associated interrupt.
 * @{
 */
#define MXC_F_WUT_INTFL_IRQ_CLR_POS                    0 /**< INTFL_IRQ_CLR Position */
#define MXC_F_WUT_INTFL_IRQ_CLR                        ((uint32_t)(0x1UL << MXC_F_WUT_INTFL_IRQ_CLR_POS)) /**< INTFL_IRQ_CLR Mask */

/**@} end of group WUT_INTFL_Register */

/**
 * @ingroup  wut_registers
 * @defgroup WUT_CTRL WUT_CTRL
 * @brief    Timer Control Register.
 * @{
 */
#define MXC_F_WUT_CTRL_TMODE_POS                       0 /**< CTRL_TMODE Position */
#define MXC_F_WUT_CTRL_TMODE                           ((uint32_t)(0x7UL << MXC_F_WUT_CTRL_TMODE_POS)) /**< CTRL_TMODE Mask */
#define MXC_V_WUT_CTRL_TMODE_ONESHOT                   ((uint32_t)0x0UL) /**< CTRL_TMODE_ONESHOT Value */
#define MXC_S_WUT_CTRL_TMODE_ONESHOT                   (MXC_V_WUT_CTRL_TMODE_ONESHOT << MXC_F_WUT_CTRL_TMODE_POS) /**< CTRL_TMODE_ONESHOT Setting */
#define MXC_V_WUT_CTRL_TMODE_CONTINUOUS                ((uint32_t)0x1UL) /**< CTRL_TMODE_CONTINUOUS Value */
#define MXC_S_WUT_CTRL_TMODE_CONTINUOUS                (MXC_V_WUT_CTRL_TMODE_CONTINUOUS << MXC_F_WUT_CTRL_TMODE_POS) /**< CTRL_TMODE_CONTINUOUS Setting */
#define MXC_V_WUT_CTRL_TMODE_COMPARE                   ((uint32_t)0x5UL) /**< CTRL_TMODE_COMPARE Value */
#define MXC_S_WUT_CTRL_TMODE_COMPARE                   (MXC_V_WUT_CTRL_TMODE_COMPARE << MXC_F_WUT_CTRL_TMODE_POS) /**< CTRL_TMODE_COMPARE Setting */

#define MXC_F_WUT_CTRL_PRES_POS                        3 /**< CTRL_PRES Position */
#define MXC_F_WUT_CTRL_PRES                            ((uint32_t)(0x7UL << MXC_F_WUT_CTRL_PRES_POS)) /**< CTRL_PRES Mask */
#define MXC_V_WUT_CTRL_PRES_DIV1                       ((uint32_t)0x0UL) /**< CTRL_PRES_DIV1 Value */
#define MXC_S_WUT_CTRL_PRES_DIV1                       (MXC_V_WUT_CTRL_PRES_DIV1 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV1 Setting */
#define MXC_V_WUT_CTRL_PRES_DIV2                       ((uint32_t)0x1UL) /**< CTRL_PRES_DIV2 Value */
#define MXC_S_WUT_CTRL_PRES_DIV2                       (MXC_V_WUT_CTRL_PRES_DIV2 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV2 Setting */
#define MXC_V_WUT_CTRL_PRES_DIV4                       ((uint32_t)0x2UL) /**< CTRL_PRES_DIV4 Value */
#define MXC_S_WUT_CTRL_PRES_DIV4                       (MXC_V_WUT_CTRL_PRES_DIV4 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV4 Setting */
#define MXC_V_WUT_CTRL_PRES_DIV8                       ((uint32_t)0x3UL) /**< CTRL_PRES_DIV8 Value */
#define MXC_S_WUT_CTRL_PRES_DIV8                       (MXC_V_WUT_CTRL_PRES_DIV8 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV8 Setting */
#define MXC_V_WUT_CTRL_PRES_DIV16                      ((uint32_t)0x4UL) /**< CTRL_PRES_DIV16 Value */
#define MXC_S_WUT_CTRL_PRES_DIV16                      (MXC_V_WUT_CTRL_PRES_DIV16 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV16 Setting */
#define MXC_V_WUT_CTRL_PRES_DIV32                      ((uint32_t)0x5UL) /**< CTRL_PRES_DIV32 Value */
#define MXC_S_WUT_CTRL_PRES_DIV32                      (MXC_V_WUT_CTRL_PRES_DIV32 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV32 Setting */
#define MXC_V_WUT_CTRL_PRES_DIV64                      ((uint32_t)0x6UL) /**< CTRL_PRES_DIV64 Value */
#define MXC_S_WUT_CTRL_PRES_DIV64                      (MXC_V_WUT_CTRL_PRES_DIV64 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV64 Setting */
#define MXC_V_WUT_CTRL_PRES_DIV128                     ((uint32_t)0x7UL) /**< CTRL_PRES_DIV128 Value */
#define MXC_S_WUT_CTRL_PRES_DIV128                     (MXC_V_WUT_CTRL_PRES_DIV128 << MXC_F_WUT_CTRL_PRES_POS) /**< CTRL_PRES_DIV128 Setting */

#define MXC_F_WUT_CTRL_TPOL_POS                        6 /**< CTRL_TPOL Position */
#define MXC_F_WUT_CTRL_TPOL                            ((uint32_t)(0x1UL << MXC_F_WUT_CTRL_TPOL_POS)) /**< CTRL_TPOL Mask */

#define MXC_F_WUT_CTRL_TEN_POS                         7 /**< CTRL_TEN Position */
#define MXC_F_WUT_CTRL_TEN                             ((uint32_t)(0x1UL << MXC_F_WUT_CTRL_TEN_POS)) /**< CTRL_TEN Mask */
#define MXC_V_WUT_CTRL_TEN_DIS                         ((uint32_t)0x0UL) /**< CTRL_TEN_DIS Value */
#define MXC_S_WUT_CTRL_TEN_DIS                         (MXC_V_WUT_CTRL_TEN_DIS << MXC_F_WUT_CTRL_TEN_POS) /**< CTRL_TEN_DIS Setting */
#define MXC_V_WUT_CTRL_TEN_EN                          ((uint32_t)0x1UL) /**< CTRL_TEN_EN Value */
#define MXC_S_WUT_CTRL_TEN_EN                          (MXC_V_WUT_CTRL_TEN_EN << MXC_F_WUT_CTRL_TEN_POS) /**< CTRL_TEN_EN Setting */

#define MXC_F_WUT_CTRL_PRES3_POS                       8 /**< CTRL_PRES3 Position */
#define MXC_F_WUT_CTRL_PRES3                           ((uint32_t)(0x1UL << MXC_F_WUT_CTRL_PRES3_POS)) /**< CTRL_PRES3 Mask */

#define MXC_F_WUT_CTRL_PWMSYNC_POS                     9 /**< CTRL_PWMSYNC Position */
#define MXC_F_WUT_CTRL_PWMSYNC                         ((uint32_t)(0x1UL << MXC_F_WUT_CTRL_PWMSYNC_POS)) /**< CTRL_PWMSYNC Mask */

#define MXC_F_WUT_CTRL_NOLHPOL_POS                     10 /**< CTRL_NOLHPOL Position */
#define MXC_F_WUT_CTRL_NOLHPOL                         ((uint32_t)(0x1UL << MXC_F_WUT_CTRL_NOLHPOL_POS)) /**< CTRL_NOLHPOL Mask */

#define MXC_F_WUT_CTRL_NOLLPOL_POS                     11 /**< CTRL_NOLLPOL Position */
#define MXC_F_WUT_CTRL_NOLLPOL                         ((uint32_t)(0x1UL << MXC_F_WUT_CTRL_NOLLPOL_POS)) /**< CTRL_NOLLPOL Mask */

#define MXC_F_WUT_CTRL_PWMCLKBD_POS                    12 /**< CTRL_PWMCLKBD Position */
#define MXC_F_WUT_CTRL_PWMCLKBD                        ((uint32_t)(0x1UL << MXC_F_WUT_CTRL_PWMCLKBD_POS)) /**< CTRL_PWMCLKBD Mask */

/**@} end of group WUT_CTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_WUT_REGS_H_
